In [2]:
import pandas as pd

In [9]:
# Leer archivo parquet

df_ba = pd.read_parquet('/home/rru/Desktop/housing.parquet')

In [10]:
df_ba

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [13]:
# Verificar si existen valores nulos

dfx = df_ba.isna().sum()

#df = df_ba

In [14]:
dfx

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [ ]:
# Aplicar borrar valores

df_na = df.dropna()

In [ ]:
df_na

In [ ]:
# Sustituir valores nulos con diferente marca 

from numpy import nan as oNA

data = pd.Series([1,oNA,2,oNA,5,oNA,7,oNA])

data

In [ ]:
# Eliminar datos nulos 

#data = data.dropna()
#data

In [ ]:
# Rellenar valor nulo - fillna  con valor arbitrario

data = data.fillna(100)

data

In [ ]:
# Rellenar valor nulo - fillna  con valor promedio

#data.mean()

data2 = data.fillna(data.mean())

data2

In [ ]:
# Rellenar varios valor nulos (nan) especificamente algunos

data.fillna({5:10,7:70})

In [ ]:
# Filtrar columna, de forma simple (Serie)
from numpy import nan

df = pd.DataFrame({ 'name': ['Bob', 'Jake', 'Lisa', 'Sue','Shannon','Paul', 'Steve'],
                    'profession': ['Phd', 'Phd','Pilot','Pilot','Designer','Economist','Designer'],
                    'salary': [70000, 80000, 120000, 90000,50000,120000,70000]})

In [ ]:
df

In [ ]:
# Encontrar el promedio de income, asignarlo al DF

dfavg = round(df['median_income'].mean(),1)

dfavg

In [ ]:
# Encontrar valores mínimos / máximos

#df['median_income'].min()
df['median_income'].max()

In [ ]:


dfavg

In [ ]:
#Filtrar valores Nulos

df[df['total_bedrooms'].isna()]

In [ ]:
# Rellenar con valores de la media los valores nulos en 

df['total_bedrooms']= df['total_bedrooms'].fillna(round(df['total_bedrooms'].mean(),2))

In [ ]:
df[df['total_bedrooms']>=500]

In [ ]:
# Filtrar a nivel de columna (atributos) & nivel registro (observaciones)

df[['ocean_proximity','population']][0:10]

In [ ]:
# Utilizar filtros a nivel de columna , operadores booleanos y aritméticos & \ 

df[(df['ocean_proximity']=='NEAR BAY') | (df['housing_median_age']>= 25)]

In [ ]:
df

In [ ]:
# Filtrar datos de acuerdo a un subconjunto in

df[df['housing_median_age'].isin([41,51])]

In [ ]:
# Crear un Rango

df[(df['housing_median_age']>=20) & (df['housing_median_age']<=40)]

In [ ]:
# Ordenar valores con sort_values

df.sort_values(['housing_median_age'],ascending=True)

In [ ]:
# Genera el grupo como Tabla (as_index = False)

df_sort01 = pd.DataFrame(df.groupby(['ocean_proximity'],as_index=False)['housing_median_age'].count())
df_sort01

In [ ]:
# Genera el grupo como Tabla Pivotante (as_index = True)

df_sort02 = pd.DataFrame(df.groupby(['ocean_proximity'],as_index=True)['housing_median_age'].count())

In [ ]:
df_sort02

In [ ]:
# Función AGG

round(df.agg({'housing_median_age':['min','max','mean','median','std','var']}),2)

In [ ]:
# Similar Describe

round(df.describe(),2)

In [ ]:
# Group by con la función Aggregate

import numpy as np

df_sort03 = pd.DataFrame(round(df.groupby(['ocean_proximity'],as_index=True)
            ['housing_median_age'].aggregate([min,np.std,np.mean,max]),2))
df_sort03

In [ ]:
# Función Apply

df_ba = df.groupby('housing_median_age').apply(max)
df_ba

In [ ]:
# Operaciones Join

df1 = pd.DataFrame({'employee': ['Bob', 'Jake'],
                       'group': ['Accounting', 'Engineering']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob'],
                    'hire_date': [2004, 2008]})

In [ ]:
df3 = pd.merge(df1,df2)

In [ ]:
df3

In [ ]:
df2

In [ ]:
df4 = pd.merge(df1, df2, on='employee')

In [ ]:
df4

In [121]:
# Operaciones Join modificadas

df1 = pd.DataFrame({'empleado': ['Bob', 'Jake','larson'],
                       'group': ['Accounting', 'Engineering','Data Engineer']})

df2 = pd.DataFrame({'empleado': ['Lisa', 'Bob'],
                    'hire_date': [2004, 2008],
                    'group':['Human Reosurces','Architect']
                   })

In [ ]:
pd.merge(df1, df2, left_on="employee", right_on="empleado")

In [105]:
pd.merge(df1, df2, left_on="employee", right_on="empleado").drop('employee', axis=1)

        group empleado  hire_date
0  Accounting      Bob       2008

In [107]:
pd.merge(df1, df2, how='inner',left_on="employee", right_on="empleado").drop('employee', axis=1)

        group empleado  hire_date
0  Accounting      Bob       2008

In [123]:
pd.merge(df1, df2, how='outer',on="group")

  empleado_x            group empleado_y  hire_date
0        Bob       Accounting        NaN        NaN
1       Jake      Engineering        NaN        NaN
2     larson    Data Engineer        NaN        NaN
3        NaN  Human Reosurces       Lisa     2004.0
4        NaN        Architect        Bob     2008.0

In [ ]:
pd.merge(df1, df2, how='right',left_on="employee", right_on="empleado").drop('employee', axis=1)

In [ ]:
# Nuevos DF modificados

df1 = pd.DataFrame({'empleado': ['Bob', 'Jake','larson'],
                       'group': ['Accounting', 'Engineering','Data Engineer']})

df2 = pd.DataFrame({'empleado': ['Lisa', 'Bob'],
                    'hire_date': [2004, 2008],
                    'group':['Human Reosurces','Architect']
                   })

In [126]:
# Unir 2 DataFrame

dfConcat = pd.concat([df1,df2])

In [127]:
df7 = pd.merge(df1, df2, how='outer',on="group")

In [128]:
# Configurar un atributo como índice

df7.set_index('group')

                empleado_x empleado_y  hire_date
group
Accounting             Bob        NaN        NaN
Engineering           Jake        NaN        NaN
Data Engineer       larson        NaN        NaN
Human Reosurces        NaN       Lisa     2004.0
Architect              NaN        Bob     2008.0